/*------------------------------------------------------------------------------
* @文件名  :    main.cpp
* @作者      :    flying
* @邮件      :    weekend@111.com
* @概要      :    无
* @注意点  :    无
* 修改历史*********************************************************************
* 时间               作者                 描述
------------------------------------------------------------------------------*/
#include <stdio.h>
#include <unistd.h>
#include "watchdog.h"

//5秒后重启
int main(int argc, char **argv)
{

    int fd = watchdog_open();

    watchdog_start(fd, 5);

    while (1)
    {
        sleep(-1);
    }
    return 1;
}
